Revit 2027 API
TemporaryViewModes.IsModeActive Method
 Tests whether a given mode is currently active or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsModeActive(
	TemporaryViewMode mode
)
Public Function IsModeActive (
	mode As TemporaryViewMode
) As Boolean
public:
bool IsModeActive(
	TemporaryViewMode mode
)
member IsModeActive :
        mode : TemporaryViewMode -> bool
Parameters
mode TemporaryViewMode
 The mode being tested
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
TemporaryViewModes Class
Autodesk.Revit.DB Namespace